# Створіть функцію fib_next(n) яка на вхід отримує один аргумент, що є цілим невід'ємним числом.
# Дана функція має знайти та повернути як результат наступне число в послідовності Фібоначчі, яке йде після заданого n.
# Якщо задане число n не входить у послідовність Фібоначчі, то функція має викинути (raise)
# виключення (exception) ValueError
#
# Послідовність починається з чисел (1, 2)
#
# Послідовність Фібоначчі, це така послідовність чисел, коли кожне наступне число дорівнює сумі двох попередніх.


def fib_next(n):
    a, b = 1, 2

    while a <= n:
        if a == n:
            return b
        a, b = b, a + b
    raise ValueError("%s is not part of Fibonacci sequence" % n)


print(fib_next(1))
print(fib_next(2))