# Створіть функцію matrix_transponse(m) яка на вхід отримує один аргумент, що є матрицею (список списків).
# Дана функція має виконати транспонування матриці за головною діагоналлю, та повернути результат.
# Вхідна матриця має залишитись без змін.
#
# Транспонована матриця t від матриці m утворюється при заміні рядків на стовпчики.
#
# Приклад вхідних даних:
#
# 1 2 3
# 4 5 6
# 7 8 9
# приклад вихідних даних:
#
# 1 4 7
# 2 5 8
# 3 6 9


def matrix_transponse(m):
    res = []
    for i_row, m_row in enumerate(m):
        row = []
        for i_col, _ in enumerate(m_row):
            row.append(m[i_col][i_row])
        res.append(row)
    return res


m = [[23, 56, 44],
     [70, 56, 77],
     [26, 27, 10]]
t = matrix_transponse(m)
print('\n'.join(str(r) for r in t))