"""
Задание 3
Модифицируйте исходный код сервиса по сокращению ссылок из предыдущих двух уроков так, чтобы
он сохранял базу ссылок на диске и не «забывал» при перезапуске. При желании можете ознакомиться
с модулем shelve (https://docs.python.org/3/library/shelve.html), который в данном случае будет весьма
удобен и упростит выполнение задания.
"""

if __name__ == '__main__':
    print(__doc__)
