# Напишите программу, которая вводит с клавиатуры текст и выводит отсортированные по алфавиту слова данного текста.
z = input('Input your text').split()
z.sort()
print(z)